Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V205xx.svd
        <register>
          <name>GPIOC_AFHR</name>
          <displayName>GPIOC_AFHR</displayName>
          <description>PC port multiplexing function register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFR8</name>
              <description>selection of multiplexing function for pin 8 of PC port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR9</name>
              <description>selection of multiplexing function for pin 9 of PC port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR10</name>
              <description>selection of multiplexing function for pin 10 of PC port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR11</name>
              <description>selection of multiplexing function for pin 11 of PC port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR12</name>
              <description>selection of multiplexing function for pin 12 of PC port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR13</name>
              <description>selection of multiplexing function for pin 13 of PC port</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR14</name>
              <description>selection of multiplexing function for pin 14 of PC port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>AFR15</name>
              <description>selection of multiplexing function for pin 15 of PC port</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
			</fields>
		</register>	

        <register>
          <name>GPIOD_AFLR</name>
          <displayName>GPIOD_AFLR</displayName>
          <description>PD port multiplexing function register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFR0</name>
              <description>selection of multiplexing function for pin 0 of PD port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR1</name>
              <description>selection of multiplexing function for pin 1 of PD port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR2</name>
              <description>selection of multiplexing function for pin 2 of PD port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR3</name>
              <description>selection of multiplexing function for pin 3 of PA port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR4</name>
              <description>selection of multiplexing function for pin 4 of PD port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR5</name>
              <description>selection of multiplexing function for pin 5 of PD port</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR6</name>
              <description>selection of multiplexing function for pin 6 of PD port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>AFR7</name>
              <description>selection of multiplexing function for pin 7 of PD port</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
			</fields>
		</register>	

        <register>
          <name>GPIOD_AFHR</name>
          <displayName>GPIOD_AFHR</displayName>
          <description>PD port multiplexing function register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFR8</name>
              <description>selection of multiplexing function for pin 8 of PD port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR9</name>
              <description>selection of multiplexing function for pin 9 of PD port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR10</name>
              <description>selection of multiplexing function for pin 10 of PD port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR11</name>
              <description>selection of multiplexing function for pin 11 of PD port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR12</name>
              <description>selection of multiplexing function for pin 12 of PD port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR13</name>
              <description>selection of multiplexing function for pin 13 of PD port</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR14</name>
              <description>selection of multiplexing function for pin 14 of PD port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>AFR15</name>
              <description>selection of multiplexing function for pin 15 of PD port</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
			</fields>
		</register>	

        <register>
          <name>GPIOE_AFLR</name>
          <displayName>GPIOE_AFLR</displayName>
          <description>PE port multiplexing function register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFR0</name>
              <description>selection of multiplexing function for pin 0 of PE port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR1</name>
              <description>selection of multiplexing function for pin 1 of PE port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR2</name>
              <description>selection of multiplexing function for pin 2 of PE port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR3</name>
              <description>selection of multiplexing function for pin 3 of PE port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR4</name>
              <description>selection of multiplexing function for pin 4 of PE port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR5</name>
              <description>selection of multiplexing function for pin 5 of PE port</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR6</name>
              <description>selection of multiplexing function for pin 6 of PE port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>AFR7</name>
              <description>selection of multiplexing function for pin 7 of PE port</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
			</fields>
		</register>	

        <register>
          <name>GPIOE_AFHR</name>
          <displayName>GPIOE_AFHR</displayName>
          <description>PA port multiplexing function register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFR8</name>
              <description>selection of multiplexing function for pin 8 of PE port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR9</name>
              <description>selection of multiplexing function for pin 9 of PE port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR10</name>
              <description>selection of multiplexing function for pin 10 of PE port</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR11</name>
              <description>selection of multiplexing function for pin 11 of PE port</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR12</name>
              <description>selection of multiplexing function for pin 12 of PE port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR13</name>
              <description>selection of multiplexing function for pin 13 of PE port</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFR14</name>
              <description>selection of multiplexing function for pin 14 of PE port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>AFR15</name>
              <description>selection of multiplexing function for pin 15 of PE port</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
			</fields>
		</register>			
