Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V205xx.svd
			<register>
				<name>R16_UEP0_CTRL</name>
				<description>endpoint control register</description>
				<addressOffset>0x32</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>			
			<register>
				<name>R16_UEP1_CTRL__R16_UH_SETUP</name>
				<description>endpoint control register</description>
				<addressOffset>0x36</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG__RB_UH_PRE_PID_EN</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions);low-speed lead packet PRE PID enable</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG__RB_UH_SOF_EN</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions);aoto generate SOF packet enable</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>
			<register>
				<name>R16_UEP2_CTRL</name>
				<description>endpoint control register</description>
				<addressOffset>0x3A</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>
			<register>
				<name>R16_UEP3_CTRL__R8_UH_TX_CTRL</name>
				<description>endpoint control register;USB host send endpoint control register</description>
				<addressOffset>0x3E</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG__RB_UH_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG__RB_UH_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_T_RES__RB_UH_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction;
						host send response control for OUT/SETUP transactions</description>
						<bitRange>[0:0]</bitRange>
					</field>						
				</fields>								
			</register>
			<register>
				<name>R16_UEP4_CTRL</name>
				<description>endpoint control register</description>
				<addressOffset>0x42</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>
			<register>
				<name>R16_UEP5_CTRL</name>
				<description>endpoint control register</description>
				<addressOffset>0x46</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>
			<register>
				<name>R16_UEP6_CTRL</name>
				<description>endpoint control register</description>
				<addressOffset>0x4A</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>
			<register>
				<name>R16_UEP7_CTRL</name>
				<description>endpoint control register</description>
				<addressOffset>0x4E</addressOffset>
				<size>0x10</size>
				<access>read-write</access>
				<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>RB_UEP_R_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[11:11]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_TOG</name>
						<description>desired synchronization trigger bit for receiver of USB endpoint
						(handling OUT transactions)</description>
						<bitRange>[10:10]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>response control of endpoint's receiver to the OUT transaction</description>
						<bitRange>[9:8]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_AUTO_TOG</name>
						<description>sync trigger bit aoto flip enable control</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>synchronization trigger bit for sender of USB endpoint
						(handling IN transactions)</description>
						<bitRange>[2:2]</bitRange>
					</field>				
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>response control of endpoint's receiver to the IN transaction</description>
						<bitRange>[1:0]</bitRange>
					</field>				
				</fields>								
			</register>
