Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V205xx.svd
			</registers>
	</peripheral>
    <peripheral>
      <name>ESIG</name>
      <description> ESIG configuration</description>
      <groupName>ESIG</groupName>
      <baseAddress>0x1FFFF7E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FLACAP</name>
          <displayName>FLACAP</displayName>
          <description>Flash capecity register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>F_SIZE</name>
              <description>F_SIZE/kByte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIID1</name>
          <displayName>UNIID1</displayName>
          <description>UID register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>U_ID</name>
              <description>U_ID value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>UNIID2</name>
          <displayName>UNIID2</displayName>
          <description>UID register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>U_ID</name>
              <description>U_ID value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

        <register>
          <name>UNIID3</name>
          <displayName>UNIID3</displayName>
          <description>Div register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AWU_APR</name>
              <description>AWU_APR value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	<peripheral>
      <name>PIOC</name>
      <description>Programmable protocol I/O microcontroller</description>
      <groupName>PIOC</groupName>
      <baseAddress>0x40025C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
		<interrupt>
		<name>PIOC</name>
		<description>PIOC global interrupt</description>
		<value>63</value>
		</interrupt>
        <registers>		
        <register>
          <name>SFR_INDIR_PORT</name>
          <displayName>SFR_INDIR_PORT</displayName>
          <description>Indirectly addressed data read/write ports</description>
          <addressOffset>0x00</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
        </register>
		
        <register>
          <name>RSFR_INDIR_PORT2</name>
          <displayName>SFR_INDIR_PORT2</displayName>
          <description>Indirectly addresses the data read/write port of 2</description>
          <addressOffset>0x01</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
        </register>
		
        <register>
          <name>SFR_PRG_COUNT</name>
          <displayName>SFR_PRG_COUNT</displayName>
          <description>Program counters for the low bytes of the PC</description>
          <addressOffset>0x02</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
        </register>
		
        <register>
          <name>SFR_STATUS_REG</name>
          <displayName>R8_SFR_STATUS_REG</displayName>
          <description>Status registers</description>
          <addressOffset>0x03</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SB_STACK_USED</name>
              <description>Current stack usage flags</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>SB_EN_TOUT_RST</name>
              <description>Timer Timeout Reset Enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>SB_GP_BIT_Y</name>
              <description>a generic bit variable Y, defined and used by the application</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_FLAG_Z</name>
              <description>ALU zero flag, whether the result is 00H</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_GP_BIT_X</name>
              <description>A generic bit variable X, defined and used by the application</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_FLAG_C</name>
              <description>ALU carry flag, whether the result is carried or produced by displacement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
          </fields>		  
        </register>
		
        <register>
          <name>SFR_INDIR_ADDR</name>
          <displayName>SFR_INDIR_ADDR</displayName>
          <description>Indirectly addressed address registers</description>
          <addressOffset>0x04</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
        </register>
		
        <register>
          <name>SFR_TMR0_COUNT</name>
          <displayName>SFR_TMR0_COUNT</displayName>
          <description>The counter register of timer 0</description>
          <addressOffset>0x05</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>		  
        </register>

        <register>
          <name>SFR_TIMER_CTRL</name>
          <displayName>SFR_TIMER_CTRL</displayName>
          <description>The control register of the timer</description>
          <addressOffset>0x06</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
        </register>

        <register>
          <name>SFR_TMR0_INIT</name>
          <displayName>SFR_TMR0_INIT</displayName>
          <description>The initial register of timer 0</description>
          <addressOffset>0x07</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
        </register>
		
        <register>
          <name>SFR_BIT_CYCLE</name>
          <displayName>SFR_BIT_CYCLE</displayName>
          <description>Periodic registers for coded bits</description>
          <addressOffset>0x08</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-write</access>
            <fields>		  
            <field>
              <name>SB_BIT_TX_O0</name>
              <description>The raw bit data of the encoded bit to be sent, which is a double-buffered structure</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CYCLE</name>
              <description>Sets the width of the encoded bits in clock cycles, which is the actual number of bits minus 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            </fields>			
        </register>		

        <register>
          <name>SFR_INDIR_ADDR2</name>
          <displayName>SFR_INDIR_ADDR2</displayName>
          <description>Address registers for indirect address 2</description>
          <addressOffset>0x09</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
        </register>

        <register>
          <name>SFR_PORT_DIR</name>
          <displayName>SFR_PORT_DIR</displayName>
          <description>The port direction sets the register</description>
          <addressOffset>0x0A</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
          <fields>			
            <field>
              <name>SB_PORT_MOD3</name>
              <description>Pin mode control, host side defines the purpose</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>SB_PORT_MOD2</name>
              <description>Pin mode control, host side defines the purpose</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_PORT_MOD1</name>
              <description>Pin mode control, host side defines the purpose</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_PORT_MOD0</name>
              <description>Pin mode control, host side defines the purpose</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>SB_PORT_PU1</name>
              <description>IO1 Pin Pull-Up Enables</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>SB_PORT_PU0</name>
              <description>IO0 Pin Pull-Up Enables</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_PORT_DIR1</name>
              <description>IO1 Pin Direction Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_PORT_DIR0</name>
              <description>IO0 Pin Direction Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
         </fields>		  	  
        </register>

        <register>
          <name>SFR_PORT_IO</name>
          <displayName>SFR_PORT_IO</displayName>
          <description>Port input and output registers</description>
          <addressOffset>0x0B</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
        </register>

        <register>
          <name>SFR_BIT_CONFIG</name>
          <displayName>SFR_BIT_CONFIG</displayName>
          <description>Coded bit configuration registers</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
          <fields>
            <field>
              <name>SB_BIT_TX_EN</name>
              <description>The transmission of the coded bits is enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CODE_MOD</name>
              <description>How the coded bits are modulated</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_PORT_IN_EDGE</name>
              <description>Pin input level sampling point selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CYC_TAIL</name>
              <description>Periodic state of the encoded bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CYC_CNT6</name>
              <description>The periodic timing state of the encoded bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CYC_CNT5</name>
              <description>The periodic timing state of the encoded bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CYC_CNT4</name>
              <description>The periodic timing state of the encoded bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB_BIT_CYC_CNT3</name>
              <description>The periodic timing state of the encoded bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
         </fields>
       </register>

        <register>
          <name>SFR_SYS_CFG</name>
          <displayName>SFR_SYS_CFG</displayName>
          <description>System configuration registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <fields>
            <field>
              <name>SB_INT_REQ</name>
              <description>Interrupt Request Activation Bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
		     <access>read-only</access>
            </field>
            <field>
              <name>SB_DATA_SW_MR</name>
              <description>SFR_CTRL_RD wait to read the status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>			
            <field>
              <name>SB_DATA_MW_SR</name>
              <description>SFR_CTRL_WR waiting to read the status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>			
            <field>
              <name>SB_MST_CFG_B4</name>
              <description>Configure information bits, software-defined uses</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>	
            <field>
              <name>SB_MST_IO_EN1</name>
              <description>Mode and output control switches for IO1 pins</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>SB_MST_IO_EN0</name>
              <description>Mode and output control switches for IO0 pins</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>			
            <field>
              <name>SB_MST_RESET</name>
              <description>Force eMCU Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>			
            <field>
              <name>SB_MST_CLK_GATE</name>
              <description>Global Clock Control for eMCUs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>			
          </fields>
        </register>
		
        <register>
          <name>SFR_CTRL_RD</name>
          <displayName>SFR_CTRL_RD</displayName>
          <description>The eMCU reads and writes and the host reads only the registers</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-only</access>
        </register>

        <register>
          <name>SFR_CTRL_WR</name>
          <displayName>SFR_CTRL_WR</displayName>
          <description>The host reads and writes and the eMCU reads only registers</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-write</access>
        </register>

        <register>
          <name>SFR_DATA_EXCH</name>
          <displayName>SFR_DATA_EXCH</displayName>
          <description>Data exchange registers</description>
          <addressOffset>0x1F</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
		  <access>read-write</access>
        </register>

        <register>
          <name>SFR_DATA_REG0</name>
          <displayName>SFR_DATA_REG0</displayName>
          <description>Data register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG1</name>
          <displayName>SFR_DATA_REG1</displayName>
          <description>Data register 1</description>
          <addressOffset>0x21</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG2</name>
          <displayName>SFR_DATA_REG2</displayName>
          <description>Data register 2</description>
          <addressOffset>0x22</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG3</name>
          <displayName>SFR_DATA_REG3</displayName>
          <description>Data register 3</description>
          <addressOffset>0x23</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG4</name>
          <displayName>SFR_DATA_REG4</displayName>
          <description>Data register 4</description>
          <addressOffset>0x24</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG5</name>
          <displayName>SFR_DATA_REG5</displayName>
          <description>Data register 5</description>
          <addressOffset>0x25</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG6</name>
          <displayName>SFR_DATA_REG6</displayName>
          <description>Data register 6</description>
          <addressOffset>0x26</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG7</name>
          <displayName>SFR_DATA_REG7</displayName>
          <description>Data register 7</description>
          <addressOffset>0x27</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG8</name>
          <displayName>SFR_DATA_REG8</displayName>
          <description>Data register 8</description>
          <addressOffset>0x28</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG9</name>
          <displayName>SFR_DATA_REG9</displayName>
          <description>Data register 9</description>
          <addressOffset>0x29</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG10</name>
          <displayName>SFR_DATA_REG10</displayName>
          <description>Data register 10</description>
          <addressOffset>0x2A</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG11</name>
          <displayName>SFR_DATA_REG11</displayName>
          <description>Data register 11</description>
          <addressOffset>0x2B</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG12</name>
          <displayName>SFR_DATA_REG12</displayName>
          <description>Data register 12</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG13</name>
          <displayName>SFR_DATA_REG13</displayName>
          <description>Data register 13</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG14</name>
          <displayName>SFR_DATA_REG14</displayName>
          <description>Data register 14</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG15</name>
          <displayName>SFR_DATA_REG15</displayName>
          <description>Data register 15</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG16</name>
          <displayName>SFR_DATA_REG16</displayName>
          <description>Data register 16</description>
          <addressOffset>0x30</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG17</name>
          <displayName>SFR_DATA_REG17</displayName>
          <description>Data register 17</description>
          <addressOffset>0x31</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG18</name>
          <displayName>SFR_DATA_REG18</displayName>
          <description>Data register 18</description>
          <addressOffset>0x32</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG19</name>
          <displayName>SFR_DATA_REG19</displayName>
          <description>Data register 19</description>
          <addressOffset>0x33</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

