Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V205xx.svd
        <register>
          <name>SFR_DATA_REG20</name>
          <displayName>SFR_DATA_REG20</displayName>
          <description>Data register 20</description>
          <addressOffset>0x34</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG21</name>
          <displayName>SFR_DATA_REG21</displayName>
          <description>Data register 21</description>
          <addressOffset>0x35</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG22</name>
          <displayName>SFR_DATA_REG22</displayName>
          <description>Data register 22</description>
          <addressOffset>0x36</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG23</name>
          <displayName>SFR_DATA_REG23</displayName>
          <description>Data register 23</description>
          <addressOffset>0x37</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG24</name>
          <displayName>SFR_DATA_REG24</displayName>
          <description>Data register 24</description>
          <addressOffset>0x38</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG25</name>
          <displayName>SFR_DATA_REG25</displayName>
          <description>Data register 25</description>
          <addressOffset>0x39</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG26</name>
          <displayName>SFR_DATA_REG26</displayName>
          <description>Data register 26</description>
          <addressOffset>0x3A</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG27</name>
          <displayName>SFR_DATA_REG27</displayName>
          <description>Data register 27</description>
          <addressOffset>0x3B</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG28</name>
          <displayName>SFR_DATA_REG28</displayName>
          <description>Data register 28</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG29</name>
          <displayName>SFR_DATA_REG29</displayName>
          <description>Data register 29</description>
          <addressOffset>0x3D</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG30</name>
          <displayName>SFR_DATA_REG30</displayName>
          <description>Data register 30</description>
          <addressOffset>0x3E</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>

        <register>
          <name>SFR_DATA_REG31</name>
          <displayName>SFR_DATA_REG31</displayName>
          <description>Data register 31</description>
          <addressOffset>0x3F</addressOffset>
          <size>0x08</size>
          <resetValue>0x00</resetValue>
          <access>read-write</access>		  
        </register>
        </registers>	

		</peripheral>
    <peripheral>
      <name>QSPI1</name>
      <description>QSPI1</description>
      <groupName>QSPI1</groupName>
      <baseAddress>0x40024C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>QSPI1</name>
        <description>QSPI1 global interrupt</description>
        <value>58</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>QSPI control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable Enable the QSPI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort request This bit aborts the
              on-going command sequence</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA mode enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>TCEN</name>
              <description>Timeout counter enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>start the FLASH command sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>write-only</access>
            </field>
            <field>
              <name>DFM</name>
              <description>Dual-flash mode This bit activates
              dual-flash mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>FSEL</name>
              <description>Flash memory selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>FTHRES</name>
              <description>FIFO threshold level Defines</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              enables the transfer error interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit enables the transfer complete
              interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>FTIE</name>
              <description>FIFO threshold interrupt enable This bit
              enables the FIFO threshold interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>SMIE</name>
              <description>Status match interrupt enable This bit
              enables the status match interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>TOIE</name>
              <description>TimeOut interrupt enable This bit
              enables the TimeOut interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>APMS</name>
              <description>Automatic poll mode stop</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>PMM</name>
              <description>Polling match mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>clock prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>QSPI device configuration
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>indicates the level that clk takes
              between command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSHT</name>
              <description>Chip select high time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FSIZE</name>
              <description>Flash memory size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>QSPI status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEF</name>
              <description>Transfer error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCF</name>
              <description>Transfer complete flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTF</name>
              <description>FIFO threshold flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMF</name>
              <description>Status match flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>Timeout flag This bit is set when
              timeout occurs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy This bit is set when an operation
              is on going</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEVEL</name>
              <description>FIFO level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <displayName>FCR</displayName>
          <description>QSPI flag clear register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEF</name>
              <description>Clear transfer error flag Writing 1
              clears the TEF flag in the QSPI_SR
              register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCF</name>
              <description>Clear transfer complete flag Writing 1
              clears the TCF flag in the QSPI_SR
              register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSMF</name>
              <description>Clear status match flag Writing 1 clears
              the SMF flag in the QSPI_SR register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTOF</name>
              <description>Clear timeout flag Writing 1 clears the
              TOF flag in the QSPI_SR register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DLR</name>
          <displayName>DLR</displayName>
          <description>QSPI data length register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DL</name>
              <description>Data length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>QSPI communication configuration
          register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSTRUCTION</name>
              <description>Instruction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IMODE</name>
              <description>Instruction mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADMODE</name>
              <description>Address mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADSIZE</name>
              <description>Address size</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABMODE</name>
              <description>Alternate bytes mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABSIZE</name>
              <description>Alternate bytes size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCYC</name>
              <description>Number of dummy cycles</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DMODE</name>
              <description>Data mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMODE</name>
              <description>Functional mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SIOO</name>
              <description>Send instruction only once mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AR</name>
          <displayName>AR</displayName>
          <description>QSPI address register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>QSPI Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABR</name>
          <displayName>ABR</displayName>
          <description>QSPI alternate bytes
          registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALTERNATE</name>
              <description>Alternate Bytes Optional data to be send
              to the external SPI device right after the address.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>QSPI data register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSMKR</name>
          <displayName>PSMKR</displayName>
          <description>QSPI polling status mask
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>Status mask Mask to be applied to the
              status bytes received in polling mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSMAR</name>
          <displayName>PSMAR</displayName>
          <description>QSPI polling status match
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCH</name>
              <description>Status match Value to be compared with
              the masked status register to get a match. This field
              can be written only when BUSY = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PIR</name>
          <displayName>PIR</displayName>
          <description>QSPI polling interval
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>Polling interval Number of CLK cycles
              between to read during automatic polling phases. This
              field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPTR</name>
          <displayName>LPTR</displayName>
          <description>QSPI low-power timeout
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
