Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V205xx.svd
        <register>
          <name>RSQR3</name>
          <displayName>RSQR3</displayName>
          <description>regular sequence register 3</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ6</name>
              <description>6th conversion in regular
              sequence</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ5</name>
              <description>5th conversion in regular
              sequence</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>4th conversion in regular
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>3rd conversion in regular
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>2nd conversion in regular
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ1</name>
              <description>1st conversion in regular
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISQR</name>
          <displayName>ISQR</displayName>
          <description>injected sequence register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JL</name>
              <description>Injected sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>4th conversion in injected
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>3rd conversion in injected
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>2nd conversion in injected
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ1</name>
              <description>1st conversion in injected
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR1_CHGOFFSET</name>
          <displayName>injected data register x_Charge data offset for injected channel x</displayName>
          <description>injected data register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
			<field>
              <name>IDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR2</name>
          <displayName>IDATAR2</displayName>
          <description>injected data register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR3</name>
          <displayName>IDATAR3</displayName>
          <description>injected data register 3</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR4</name>
          <displayName>IDATAR4</displayName>
          <description>injected data register 4</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATAR</name>
          <displayName>RDATAR</displayName>
          <description>regular data register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>			
          </fields>
        </register>
		
        <register>
          <name>TKEY_CTLR</name>
          <displayName>TKEY_CTLR</displayName>
          <description>TKEY control register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TKEN</name>
              <description>TKEY enabler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ITUNE</name>
              <description>Charging current configuration of the TKEY module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>TKEY mode configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Channel selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>TKACT</name>
              <description>TKEY triggers the control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>SCANIE</name>
              <description>TKEY Channel Scan Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>SCANEN</name>
              <description>TKEY channel sweep function enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>SCANNUM</name>
              <description>Configure the number of TKEY scanning channels</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TKEY_TRANS_CFG</name>
          <displayName>TKEY_TRANS_CFG</displayName>
          <description>Charge Shift Configuration Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TKSW</name>
              <description>TKEY switch switching time configuration</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRANSN</name>
              <description>The actual number of transfer cycles is TRANSN+1, that is,
			  the maximum number of transfer cycles is 1024</description>
              <bitOffset>3</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>TRANSCC</name>
              <description>In charge transfer mode, touch the button capacitor charge charge T2 and charge transfer time T4 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_CFG</name>
          <displayName>CAP_CFG</displayName>
          <description>Capacitor Configuration Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>		
            <field>
              <name>SELCS</name>
              <description>In charge transfer mode, a channel for charge transfer is configured</description>
              <bitOffset>4</bitOffset>
              <bitWidth>16</bitWidth>
            </field>			
            <field>
              <name>SELCX</name>
              <description>In charge transfer mode, the channel with an external reference capacitor is configured, 
			  and in current source charging mode, this bit is invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>						
          </fields>
        </register>		
        <register>
          <name>DRV_CFG</name>
          <displayName>DRV_CFG</displayName>
          <description>Driver Shield Configuration Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DRVEN</name>
              <description>Drive Shielding Function Enable Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRVOUTSEL</name>
              <description>Drive shield channel selection, active high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>									
          </fields>
        </register>		
        <register>
          <name>TKEY_CDCC</name>
          <displayName>TKEY_CDCC</displayName>
          <description>TKEY Charge-Discharge Configuration Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TKCD</name>
              <description>In current source charging mode, the discharge time is configured</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>TKCC</name>
              <description>In the current source charging mode, the charging time is configured</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>									
          </fields>
        </register>			
        <register>
          <name>TKEY_SR</name>
          <displayName>TKEY_SR</displayName>
          <description>TKEY Status Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCANIF</name>
              <description>The TKEY channel scan is interrupted at the end of the mark,
			  the software writes 0 clear, and the write 1 is invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>									
          </fields>
        </register>				
