Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V205xx.svd
      </registers>
    </peripheral>
	<peripheral>
      <name>OPA</name>
      <description> OPA configuration</description>
      <groupName>OPA</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>OPA</name>
        <description>OPA global interrupt</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>CMP_WKUP</name>
        <description>CMP wake-up interrupt</description>
        <value>68</value>
      </interrupt>	  
      <registers>
        <register>
          <name>OPA_CFGR1</name>
          <displayName>OPA_CFGR1</displayName>
          <description>OPA configuration Register 1</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>  
            <field>
              <name>BKIN_CFG</name>
              <description>Timer brake configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field> 
               <field>
              <name>RST_EN1</name>
              <description>OPA1 reset enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_OUT1</name>
              <description>OPA1 interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>  
            <field>
              <name>IE_CNT1</name>
              <description>OPA interrupt enable at the end of polling interval</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
                 <field>
              <name>NMI_EN1</name>
              <description>OPA connection NMI interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>STCFG1</name>
              <description>OPA1 establishes a time configuration bit in system clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>SMPSEL1</name>
              <description>Sampling Source Selection Bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
            <field>
              <name>POLLMD1</name>
              <description>OPA1 polling mode configuration register</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 	
            <field>
              <name>OPA_LOCK</name>
              <description>OPA LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 			
        </fields>
        </register>
        <register>
          <name>OPA_CTLR1</name>
          <displayName>OPA_CTLR1</displayName>
          <description>OPA control register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x01D801D8</resetValue>
          <fields>
            <field>
              <name>POLL_CH3</name>
              <description>OPA1 Polling Order</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_CH2</name>
              <description>OPA1 Polling Order</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_CH1</name>
              <description>OPA1 Polling Order</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_SWSTRT</name>
              <description>To start OPA1 polling, you need to set the software trigger</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POLL_SEL</name>
              <description>OPA1 polling trigger source selection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL1_NUM</name>
              <description>OPA1 polling the number of positive ends</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_EN1</name>
              <description>OPA1 enable positive polling</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHOPSEL1</name>
              <description>OPA1 Chopper Frequency Selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>CHOPEN1</name>
              <description>OPA1 Chopper Enablement</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS1</name>
              <description>OPA1 high-speed mode enables</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGADIF1</name>
              <description>OPA1 Output Bias Voltage Selection for Internal PGA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>FB_EN1</name>
              <description>OPA1 internal feedback resistance enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>PGA_SEL1</name>
              <description>OPA1 Gain Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>			
			<field>
              <name>NSEL1</name>
              <description>OPA1 negative end channel selection with PGA gain selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL1</name>
              <description>OPA1 forward input selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>OPA1 output channel selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN1</name>
              <description>OPA1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
        <register>
          <name>OPA_CTLR2</name>
          <displayName>OPA_CTLR2</displayName>
          <description>OPA control register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000030E</resetValue>
          <fields>
            <field>
              <name>HS2</name>
              <description>OPA2 high-speed mode enables</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGADIF2</name>
              <description>OPA2 for internal PGA output bias voltage selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		
            <field>
              <name>FB_EN2</name>
              <description>OPA2 internal feedback resistance enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>PGA_SEL2</name>
              <description>OPA2 Gain Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>			
			<field>
              <name>NSEL2</name>
              <description>OPA2 negative end channel selection with PGA gain selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL2</name>
              <description>OPA2 forward input selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>OPA2 output channel selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2</name>
              <description>OPA2 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
        <register>
          <name>CMP_CTLR</name>
          <displayName>CMP_CTLR</displayName>
          <description>CMP control register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x8000707C</resetValue>
          <fields>
            <field>
              <name>CMP_LOCK</name>
              <description>OPA LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 		  
            <field>
              <name>DACDAT</name>
              <description>DAC data configuration bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>DACEN</name>
              <description>DAC enable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>WKUP_MD</name>
              <description>CMP wake-up signal mode selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>		  		  
            <field>
              <name>LP2</name>
              <description>CMP2 low-power switch</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP1</name>
              <description>CMP1 low-power switch</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKIN_SEL</name>
              <description>Timer brake source configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>RST_EN2</name>
              <description>CMP2 reset enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_EN1</name>
              <description>CMP1 reset enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
            <name>HYEN2</name>
            <description>CMP2 hysteresis comparator switch</description>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
			</field>
            <field>
              <name>PSEL2</name>
              <description>CMP2 forward input selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL2</name>
              <description>CMP2 negative input selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>CMP2 Output channel selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2</name>
              <description>CMP2 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
            <name>HYEN1</name>
            <description>CMP1 hysteresis comparator switch</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
			</field>
            <field>
              <name>PSEL1</name>
              <description>CMP1 forward input selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL1</name>
              <description>CMP1 negative input selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>CMP1 Output channel selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN1</name>
              <description>CMP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>
        <register>
          <name>CMP_FILT</name>
          <displayName>CMP_FILT</displayName>
          <description>Comparator Filter Configuration Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FILT2</name>
              <description>The CMP2 filter sampling interval configuration bit is 0.375us</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FILT_EN2</name>
              <description>CMP2 Filter Enable Bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>FILT1</name>
              <description>The CMP1 filter sampling interval configuration bit is 0.375us</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FILT_EN1</name>
              <description>CMP1 Filter Enable Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>						
          </fields>
        </register>
        <register>
          <name>OPA_KEY</name>
          <displayName>OPA_KEY</displayName>
          <description>OPA unlock key Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPA_KEY</name>
              <description>OPA unlockkey</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>		
            </field>		
          </fields>		
        </register>	
        <register>
          <name>CMP_KEY</name>
          <displayName>CMP_KEY</displayName>
          <description>CMP unlock key Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP_KEY</name>
              <description>CMP unlockkey</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>		
            </field>		
          </fields>		
        </register>	
        <register>
          <name>OPCM_SR</name>
          <displayName>OPCM_SR</displayName>
          <description>OPA and CMP Status Registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IF_CNT1</name>
              <description>OPA1 Polling Interval End Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IF_OUT_POLL_CH3</name>
              <description>The 3rd polling channel polls to the flag that the output is high</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>IF_OUT_POLL_CH2</name>
              <description>The second polling channel polls to the flag that the output is high</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>IF_OUT_POLL_CH1</name>
              <description>The 1st polling channel polls for a flag whose output is high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>						
          </fields>
        </register>		
      </registers>
    </peripheral>	
		
	<peripheral>
      <name>LVDS</name>
      <description>LVDS</description>
      <groupName>LVDS</groupName>
      <baseAddress>0x40027C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
		<interrupt>
		<name>LVDS</name>
		<description>LVDS global interrupt</description>
		<value>70</value>
		</interrupt>		
		</peripheral>		
	</peripherals>
 </device>
